In [3]:
import pandas as pd
import numpy as np

In [4]:
a = {"a":[1,np.nan,2,3,np.nan,4,np.nan],
    "b":[9,np.nan,np.nan,7,np.nan,9,np.nan],
    "c":[2,np.nan,np.nan,np.nan,4,7,8]}

In [5]:
df = pd.DataFrame(a)

In [6]:
df

     a    b    c
0  1.0  9.0  2.0
1  NaN  NaN  NaN
2  2.0  NaN  NaN
3  3.0  7.0  NaN
4  NaN  NaN  4.0
5  4.0  9.0  7.0
6  NaN  NaN  8.0

In [22]:
df[df.isnull().any(axis = 1)].reset_index()

   index    a    b    c
0      1  NaN  NaN  NaN
1      2  2.0  NaN  NaN
2      3  3.0  7.0  NaN
3      4  NaN  NaN  4.0
4      6  NaN  NaN  8.0

In [28]:
df.notnull().any(axis = 0)

a    True
b    True
c    True
dtype: bool

In [79]:
exp = df.notnull().any(axis = 1)
exp

0     True
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

In [78]:
#dropping process by truth values. Dropping df.drop(Requires indexes not truth values but this is dropping by truth values)
df[exp]

     a    b    c
0  1.0  9.0  2.0
2  2.0  NaN  NaN
3  3.0  7.0  NaN
4  NaN  NaN  4.0
5  4.0  9.0  7.0
6  NaN  NaN  8.0

In [81]:
# dropping with pd.drop()

In [85]:
a = exp[~exp]
a

1    False
dtype: bool

In [87]:
df.drop(a.index) # drop with drop function by index

     a    b    c
0  1.0  9.0  2.0
2  2.0  NaN  NaN
3  3.0  7.0  NaN
4  NaN  NaN  4.0
5  4.0  9.0  7.0
6  NaN  NaN  8.0

In [36]:
df.loc[:,[True,True,False]]

     a    b
0  1.0  9.0
1  NaN  NaN
2  2.0  NaN
3  3.0  7.0
4  NaN  NaN
5  4.0  9.0
6  NaN  NaN

In [37]:
df.loc[df.notnull().any(axis = 1),[False,True,True]]

     b    c
0  9.0  2.0
2  NaN  NaN
3  7.0  NaN
4  NaN  4.0
5  9.0  7.0
6  NaN  8.0

In [53]:
df.notnull().any(axis = 1) # if any column's value is not complete null.

0     True
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

In [40]:
df.dropna(axis=0)

     a    b    c
0  1.0  9.0  2.0
5  4.0  9.0  7.0

In [48]:
df.mean(axis=0)

a    2.500000
b    8.333333
c    5.250000
dtype: float64

In [50]:
df['a'].fillna(df['a'].mean())

0    1.0
1    2.5
2    2.0
3    3.0
4    2.5
5    4.0
6    2.5
Name: a, dtype: float64

In [51]:
df.apply(lambda x : x.fillna(x.mean()),axis = 0) # the upper cell do it for one column we want to do for all columns.

     a         b     c
0  1.0  9.000000  2.00
1  2.5  8.333333  5.25
2  2.0  8.333333  5.25
3  3.0  7.000000  5.25
4  2.5  8.333333  4.00
5  4.0  9.000000  7.00
6  2.5  8.333333  8.00

In [52]:
df.apply(lambda x : x.fillna(x.mean()),axis = 1) #dummy example fillna by row

     a    b    c
0  1.0  9.0  2.0
1  NaN  NaN  NaN
2  2.0  2.0  2.0
3  3.0  7.0  5.0
4  4.0  4.0  4.0
5  4.0  9.0  7.0
6  8.0  8.0  8.0

In [55]:
def fillnullvalue(x):
    mean = x.mean()
    x[x.isnull()] = mean
    return x

#df.apply(lambda x : x.fillna(x.mean()),axis = 0)
df.apply(fillnullvalue, axis = 0) #!! same as upper code

     a         b     c
0  1.0  9.000000  2.00
1  2.5  8.333333  5.25
2  2.0  8.333333  5.25
3  3.0  7.000000  5.25
4  2.5  8.333333  4.00
5  4.0  9.000000  7.00
6  2.5  8.333333  8.00

In [90]:
df[(df == 1.0).any(axis=1)]

     a    b    c
0  1.0  9.0  2.0

In [92]:
(df == 1.0).any(axis=1).sum()

1

In [93]:
df.dropna(how = 'all') # the with all columns is null (shortcut of df.isnull().any()|all())

     a    b    c
0  1.0  9.0  2.0
2  2.0  NaN  NaN
3  3.0  7.0  NaN
4  NaN  NaN  4.0
5  4.0  9.0  7.0
6  NaN  NaN  8.0

In [98]:
df.dropna(axis = 1, how = 'any')  # any is default

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [99]:
df.dropna(axis=0, how = 'any')

     a    b    c
0  1.0  9.0  2.0
5  4.0  9.0  7.0

In [101]:
df.fillna(df.mean())

     a         b     c
0  1.0  9.000000  2.00
1  2.5  8.333333  5.25
2  2.0  8.333333  5.25
3  3.0  7.000000  5.25
4  2.5  8.333333  4.00
5  4.0  9.000000  7.00
6  2.5  8.333333  8.00

In [104]:
df.fillna(df.mean()[['a','b']]) # only fill a,b columns with a,b means

     a         b    c
0  1.0  9.000000  2.0
1  2.5  8.333333  NaN
2  2.0  8.333333  NaN
3  3.0  7.000000  NaN
4  2.5  8.333333  4.0
5  4.0  9.000000  7.0
6  2.5  8.333333  8.0

In [105]:
df['c'].fillna(df['c'].median())

0    2.0
1    5.5
2    5.5
3    5.5
4    4.0
5    7.0
6    8.0
Name: c, dtype: float64

In [ ]:
# fillna 1 scalar parameters : traverse go and fill with that one parameter
# fillname with series go index by

In [8]:
df['c'].fillna(pd.Series([1,2,3,4,5,6]))

0    2.0
1    2.0
2    3.0
3    4.0
4    4.0
5    7.0
6    8.0
Name: c, dtype: float64

In [1]:
2+5

7